#### StairsWinderStyle Enumeration

---

|  |
| --- |
| See Also |

The calculation method for the layout of the winder run steps.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsWinderStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsWinderStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsWinderStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Balanced | Symmetrical layout style. |
| SinglePoint | Asymmetrical layout style. Winder style is calculated from a single center point. |

# See Also

Autodesk.Revit.DB.Architecture Namespace